py32-rs/py32-data/svd/PY32M070xx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1"
  xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Puya</vendor>
  <vendorID>Puya</vendorID>
  <name>PY32F0xx_DFP</name>  <!-- name of part-->
  <series>PY32F0</series>
  <version>1.0.0</version>
  <description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>
  <cpu>    <!-- details about the cpu embedded in the device -->
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>  <!-- byte addressable memory -->
  <width>32</width>  <!-- bus width is 32 bits -->  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>  <!-- this is the default size (number of bits) of all peripherals and register that do not define "size" themselves -->
  <access>read-write</access>  <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>  <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>  <!-- by default all 32Bits of the registers are used -->
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>AWD</name>
              <description>desc AWD</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC</name>
              <description>desc EOC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JEOC</name>
              <description>desc JEOC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSTRT</name>
              <description>desc JSTRT</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STRT</name>
              <description>desc STRT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVER</name>
              <description>desc OVER</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>AWDCH</name>
              <description>desc AWDCH</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOCIE</name>
              <description>desc EOCIE</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWDIE</name>
              <description>desc AWDIE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JEOCIE</name>
              <description>desc JEOCIE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN</name>
              <description>desc SCAN</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWDSGL</name>
              <description>desc AWDSGL</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JAUTO</name>
              <description>desc JAUTO</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCEN</name>
              <description>desc DISCEN</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JDISCEN</name>
              <description>desc JDISCEN</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCNUM</name>
              <description>desc DISCNUM</description>
              <msb>15</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JAWDEN</name>
              <description>desc JAWDEN</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWDEN</name>
              <description>desc AWDEN</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESSEL</name>
              <description>desc RESSEL</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSTP</name>
              <description>desc ADSTP</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVETIE</name>
              <description>desc OVETIE</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADON</name>
              <description>desc ADON</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CONT</name>
              <description>desc CONT</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL</name>
              <description>desc CAL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTCAL</name>
              <description>desc RSTCAL</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>desc DMA</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIGN</name>
              <description>desc ALIGN</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>desc JEXTSEL</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JEXTTRIG</name>
              <description>desc JEXTTRIG</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>desc EXTSEL</description>
              <msb>19</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTTRIG</name>
              <description>desc EXTTRIG</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSWSTART</name>
              <description>desc JSWSTART</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWSTART</name>
              <description>desc SWSTART</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSVREFE</name>
              <description>desc TSVREFE</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VERFBUFFERE</name>
              <description>desc VERFBUFFERE</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VERFBUFFERSEL</name>
              <description>desc VERFBUFFERSEL</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>desc SMPR1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SMP20</name>
              <description>desc SMP20</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP21</name>
              <description>desc SMP21</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP22</name>
              <description>desc SMP22</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP23</name>
              <description>desc SMP23</description>
              <msb>11</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <description>desc SMPR2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SMP10</name>
              <description>desc SMP10</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP11</name>
              <description>desc SMP11</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP12</name>
              <description>desc SMP12</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP13</name>
              <description>desc SMP13</description>
              <msb>11</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP14</name>
              <description>desc SMP14</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP15</name>
              <description>desc SMP15</description>
              <msb>17</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP16</name>
              <description>desc SMP16</description>
              <msb>20</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP17</name>
              <description>desc SMP17</description>
              <msb>23</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP18</name>
              <description>desc SMP18</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP19</name>
              <description>desc SMP19</description>
              <msb>29</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR3</name>
          <description>desc SMPR2</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SMP0</name>
              <description>desc SMP0</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP1</name>
              <description>desc SMP1</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP2</name>
              <description>desc SMP2</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP3</name>
              <description>desc SMP3</description>
              <msb>11</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP4</name>
              <description>desc SMP4</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP5</name>
              <description>desc SMP5</description>
              <msb>17</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP6</name>
              <description>desc SMP6</description>
              <msb>20</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP7</name>
              <description>desc SMP7</description>
              <msb>23</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP8</name>
              <description>desc SMP8</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP9</name>
              <description>desc SMP9</description>
              <msb>29</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR1</name>
          <description>desc JOFR1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JOFFSET1</name>
              <description>desc JOFFSET1</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR2</name>
          <description>desc JOFR2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JOFFSET2</name>
              <description>desc JOFFSET2</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR3</name>
          <description>desc JOFR3</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JOFFSET3</name>
              <description>desc JOFFSET3</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR4</name>
          <description>desc JOFR4</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JOFFSET4</name>
              <description>desc JOFFSET4</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR</name>
          <description>desc HTR</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <description>desc HT</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR</name>
          <description>desc LTR</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>LT</name>
              <description>desc LT</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <description>desc SQR1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SQ13</name>
              <description>desc SQ13</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ14</name>
              <description>desc SQ14</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ15</name>
              <description>desc SQ15</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ16</name>
              <description>desc SQ16</description>
              <msb>19</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>L</name>
              <description>desc L</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
