py32-rs/py32-data/svd/PY32M070xx.svd
        <register>
          <name>SQR2</name>
          <description>desc SQR2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SQ7</name>
              <description>desc SQ7</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ8</name>
              <description>desc SQ8</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ9</name>
              <description>desc SQ9</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ10</name>
              <description>desc SQ10</description>
              <msb>19</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ11</name>
              <description>desc SQ11</description>
              <msb>24</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ12</name>
              <description>desc SQ12</description>
              <msb>29</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <description>desc SQR3</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SQ1</name>
              <description>desc SQ1</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ2</name>
              <description>desc SQ2</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ3</name>
              <description>desc SQ3</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ4</name>
              <description>desc SQ4</description>
              <msb>19</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ5</name>
              <description>desc SQ5</description>
              <msb>24</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ6</name>
              <description>desc SQ6</description>
              <msb>29</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <description>desc JSQR</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JSQ1</name>
              <description>desc JSQ1</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSQ2</name>
              <description>desc JSQ2</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSQ3</name>
              <description>desc JSQ3</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSQ4</name>
              <description>desc JSQ4</description>
              <msb>19</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JL</name>
              <description>desc JL</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <description>desc JDR1</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JDR1</name>
              <description>desc JDR1</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>desc JDR2</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JDR2</name>
              <description>desc JDR2</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>desc JDR3</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JDR3</name>
              <description>desc JDR3</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>desc JDR4</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>JDR4</name>
              <description>desc JDR4</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <description>desc CCSR</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CALSEL</name>
              <description>desc CALSEL</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALSMP</name>
              <description>desc CALSMP</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALBYP</name>
              <description>desc CALBYP</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALSET</name>
              <description>desc CALSET</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSUC</name>
              <description>desc OFFSUC</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPSUC</name>
              <description>desc CAPSUC</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALON</name>
              <description>desc CALON</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
