py32-rs/py32-data/svd/PY32M070xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>desc FLASH</description>
      <groupName>FLASH</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <description>desc ACR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x500</resetValue>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>desc LATENCY</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <description>desc KEYR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <description>desc OPTKEYR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>desc OPTKEY</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>EOP</name>
              <description>desc EOP</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WRPERR</name>
              <description>desc WRPERR</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>desc OPTVERR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BSY</name>
              <description>desc BSY</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>PG</name>
              <description>desc PG</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PER</name>
              <description>desc PER</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MER</name>
              <description>desc MER</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SER</name>
              <description>desc SER</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>desc OPTSTRT</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PGSTRT</name>
              <description>desc PGSTRT</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOPIE</name>
              <description>desc EOPIE</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>desc ERRIE</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>desc OBL_LAUNCH</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>desc OPTLOCK</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>desc LOCK</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <description>desc OPTR</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>RDP</name>
              <description>desc RDP</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>desc IWDG_SW</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>desc WWDG_SW</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>NRST_MODE</name>
              <description>desc NRST_MODE</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>NBOOT1</name>
              <description>desc nBOOT1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>desc IWDG_STOP</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDKR</name>
          <description>desc SDKR</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SDK_STRT</name>
              <description>desc SDK_STRT</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>BOR_EN</name>
              <description>desc BOR_EN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SDK_END</name>
              <description>desc SDK_END</description>
              <msb>12</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>desc BOR_LEV</description>
              <msb>15</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR</name>
          <description>desc WRPR</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WRP</name>
              <description>desc WRP</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STCR</name>
          <description>desc STCR</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00006400</resetValue>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>desc SLEEP_EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP_TIME</name>
              <description>desc SLEEP_TIME</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <description>desc TS0</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB4</resetValue>
          <fields>
            <field>
              <name>TS0</name>
              <description>desc TS0</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <description>desc TS1</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1B0</resetValue>
          <fields>
            <field>
              <name>TS1</name>
              <description>desc TS1</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <description>desc TS2P</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB4</resetValue>
          <fields>
            <field>
              <name>TS2P</name>
              <description>desc TS2P</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <description>desc TPS3</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6C0</resetValue>
          <fields>
            <field>
              <name>TPS3</name>
              <description>desc TPS3</description>
              <msb>10</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <description>desc TS3</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB4</resetValue>
          <fields>
            <field>
              <name>TS3</name>
              <description>desc TS3</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERTPE</name>
          <description>desc PERTPE</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xEA60</resetValue>
          <fields>
            <field>
              <name>PERTPE</name>
              <description>desc PERTPE</description>
              <msb>16</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMERTPE</name>
          <description>desc SMERTPE</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFD20</resetValue>
          <fields>
            <field>
              <name>SMERTPE</name>
              <description>desc SMERTPE</description>
              <msb>16</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <description>desc PRGTPE</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8CA0</resetValue>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>desc PRGTPE</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <description>desc PRETPE</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12C0</resetValue>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>desc PRETPE</description>
              <msb>13</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
